[errorMsg]

PCT_ERR_FAIL="未知的错误"

PCT_ERR_INVALUD_PARS="无效参数"

PCT_ERR_NOT_SURPPORT="不支持"

PCT_ERR_OPEN_FILE_FAIL="打开文件失败"

PCT_ERR_NO_MEMORY="内存不足"

PCT_ERR_READ_FILE="读取文件失败。"

PCT_ERR_FILE_FORMAT="文件格式错误"

PCT_ERR_NOMORE_ITEM="没有其他文件"

PCT_ERR_FILE_PROCESS="处理文件失败"

PCT_ERR_MEMORY_FAIL="内存错误"

PCT_ERR_WRITE_FILE="写文件失败"

PCT_ERR_USER_CANCEL="用户已取消"

PCT_ERR_NOT_INIT_FUN="未初始化的"

PCT_ERR_CREATE_THREAD="创建线程失败"

PCT_ERR_DEVICE_NO_MORE_SPACE="磁盘空间不足"

PCT_ERR_DEVICE_FAIL="设备错误"

PCT_ERR_PATH_INVALID="无效路径"

PCT_ERR_CALL_API="调用失败"

PCT_ERR_FILE_NOT_EXIST="文件不存在"

PCT_ERR_FILE_IN_USING="该文件正在被其他程序使用。"

PCT_ERR_REG_FAIL="注册表错误"

PCT_ERR_NET_CONN="网络未连接或已断开"

PCT_ERR_LICENSE_OUTDATA="许可证已过期"

PCT_ERR_NOT_SAME_VERSION="版本不一致"

PCT_ERR_NO_DISKSPACE="磁盘空间不足"

PCT_ERR_NTFS_MUST="传输应用程序失败因为这些应用程序不是安装在NTFS文件系统里的。"

PCT_ERR_INSTALL_APPX_FAILED="应用程序与目标PC不兼容。你需要重新安装。"

PCT_ERR_MOVE_APPX_FAILED="应用程序与目标分区的文件系统不兼容。"

